<a href="https://colab.research.google.com/github/thimontenegro/Dataquest/blob/master/pandas-intro.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [0]:
labels = ['a','b','c']
mylist = [10,20,30]

arr = np.array([10,20,30])
d = {'a': 10, 'b': 20, 'c': 30}

In [0]:
pd.Series(data = mylist, index = labels)

a    10
b    20
c    30
dtype: int64

In [0]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [0]:
salesQ1 = pd.Series(data = [250, 450, 200, 150], index = ['USA', 'China', 'India', 'Brazil'])

In [0]:
salesQ1
salesQ2 = pd.Series(data = [450, 550, 210, 180], index = ['USA', 'China', 'India', 'Argentina'])
salesQ2

USA          450
China        550
India        210
Argentina    180
dtype: int64

In [0]:
salesQ2['China']

550

In [0]:
salesQ1 + salesQ2

Argentina       NaN
Brazil          NaN
China        1000.0
India         410.0
USA           700.0
dtype: float64


1.   DataFrame is our main goal for thios working with data
2.   DataFrame is simply multiple pandas series that share the same index
3. You can think of a DataFrame as being similar to a spreadsheet!

In [0]:
columns = ['W', 'X', 'Y','Z']
index = ['A','B','C','D',' E']

In [0]:
from numpy.random import randint

In [0]:
np.random.seed(42)
data = randint(-100,100,(5,4))
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [0]:
df = pd.DataFrame(data, index, columns)
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

DataFrame columns are just series!

In [0]:
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

In [0]:
df['new'] = df['W'] + df['Y']
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [0]:
df = df.drop('new', axis = 1)

KeyError: ignored

In [0]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [0]:
df.loc[['A','B','C']]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [0]:
df.iloc[0:3]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80
C  2  21 -26 -13

In [0]:
df.drop('C')

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [0]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26

In [0]:
df[df > 0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [0]:
df['X'] > 0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [0]:
df[df['X'] > 0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [0]:
new_df = df[(df['W'] > 0) & (df['Y'] > 1)]
new_df

    W   X   Y   Z
B   6 -29  88 -80
D  16  -1   3  51

In [0]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [0]:
 new_ind = ['CA', 'NY', 'WY', 'OR', 'CO']

 df['States'] = new_ind

 df

    W   X   Y   Z States
A   2  79  -8 -86     CA
B   6 -29  88 -80     NY
C   2  21 -26 -13     WY
D  16  -1   3  51     OR
E  30  49 -48 -99     CO

In [0]:
df = df.set_index('States')
df.columns

KeyError: ignored

In [0]:
df

         W   X   Y   Z
States
CA       2  79  -8 -86
NY       6 -29  88 -80
WY       2  21 -26 -13
OR      16  -1   3  51
CO      30  49 -48 -99

In [0]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
W    5 non-null int64
X    5 non-null int64
Y    5 non-null int64
Z    5 non-null int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [0]:
df.dtypes

W    int64
X    int64
Y    int64
Z    int64
dtype: object

# Dealing with Missing Data


*   Real World datasets often have missing data
*   Realistically there are only 3 ways to deal with missing data 

      *   Leave it as missing
      *   Remove the missing data
      *   Fill in the missing data

* Leave it as missing 
    * Depending of the type of data, this is a valid choice
    * If dealing with categorical data, we could simply treat a NaN as another category


* Remove the missing data
    * Dependent on how much data is missing
      * Large percentage - too much is missing to make a reasonable guess
      * Small Percentage - only remove  a few data points from our dataset;

* Fill in missing data:
  * A non-trivial percentage is missing and the data point rows are important
  * Lot's of strategies available:
      * Mode, Mean, Median
      * Based off another feature column, conceive of a reasonable value.

In [0]:
df = pd.DataFrame({'A': [1,2,np.nan, 4],
                   'B': [5, np.nan,np.nan,8],
                   'C': [10, 20, 30, 40]})
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [0]:
df.dropna()

     A    B   C
0  1.0  5.0  10
3  4.0  8.0  40

Fill data

In [0]:
df.fillna(value = 5)

     A    B   C
0  1.0  5.0  10
1  2.0  5.0  20
2  5.0  5.0  30
3  4.0  8.0  40

In [0]:
df['A'] = df['A'].fillna(value = 0)
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

In [0]:
df['B'] = df['B'].fillna(value = df['B'].mean())
df

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  NaN  6.5  30
3  4.0  8.0  40

In [0]:
df = df.fillna(df.mean())
df

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40

# Group By
Often we want to explreo how values are distributed or aggregated across groups.

To do this we use the groupby method, similar to a GROUP BY call in SQL

This process is also ofter referred to Split-Apply-Combine

The operation chosen with a grouby() call must be an aggregation method.

This means it can  take multiple values and combine them to return a singular value.
  *   Sum, Std, Mean, Count, Max, Min..

In [0]:
import pandas as pd

In [0]:
df = pd.read_csv('Universities.csv')
df.head()

                                 Sector  ... Geography
0            Private for-profit, 2-year  ...    Nevada
1  Private for-profit, less-than 2-year  ...    Nevada
2  Private for-profit, less-than 2-year  ...    Nevada
3  Private for-profit, less-than 2-year  ...    Nevada
4               Public, 4-year or above  ...    Nevada

[5 rows x 5 columns]

In [0]:
df.groupby('University') #Need some aggregation method!

In [0]:
df.groupby("Year").mean()

      Completions
Year
2012   535.078947
2013   526.150000
2014   588.809524
2015   597.250000
2016   609.860465

In [0]:
type(df.groupby("University").sum())

pandas.core.frame.DataFrame

In [0]:
df.groupby('Year').sum().sort_index(ascending = False)

      Completions
Year
2016        26224
2015        26279
2014        24730
2013        21046
2012        20333

In [0]:
df.groupby(['Year', 'Sector']).sum()

                                              Completions
Year Sector
2012 Private for-profit, 2-year                      3072
     Private for-profit, 4-year or above              632
     Private for-profit, less-than 2-year            1327
     Private not-for-profit, 2-year                   665
     Private not-for-profit, 4-year or above         1059
     Public, 2-year                                  1170
     Public, 4-year or above                        12408
2013 Private for-profit, 2-year                      3053
     Private for-profit, 4-year or above              775
     Private for-profit, less-than 2-year            1281
     Private not-for-profit, 2-year                   471
     Private not-for-profit, 4-year or above         1016
     Public, 2-year                                  1633
     Public, 4-year or above                        12817
2014 Private for-profit, 2-year                      2957
     Private for-profit, 4-year or above             1506
     Private for-profit, less-than 2-year            1328
     Private not-for-profit, 2-year                   449
     Private not-for-profit, 4-year or above         1042
     Public, 2-year                                  2286
     Public, 4-year or above                        15162
2015 Private for-profit, 2-year                      3280
     Private for-profit, 4-year or above             1306
     Private for-profit, less-than 2-year            1629
     Private not-for-profit, 2-year                   425
     Private not-for-profit, 4-year or above         1228
     Public, 2-year                                  2355
     Public, 4-year or above                        16056
2016 Private for-profit, 2-year                      3286
     Private for-profit, 4-year or above              748
     Private for-profit, less-than 2-year            1552
     Private not-for-profit, 2-year                   322
     Private not-for-profit, 4-year or above         1208
     Public, 2-year                                  2431
     Public, 4-year or above                        16677

In [0]:
df.groupby("Year").describe().transpose()

Year                      2012         2013  ...         2015         2016
Completions count    38.000000    40.000000  ...    44.000000    43.000000
            mean    535.078947   526.150000  ...   597.250000   609.860465
            std    1036.433239  1040.474782  ...  1183.371791  1235.952796
            min      13.000000     0.000000  ...     0.000000     0.000000
            25%     114.250000    98.500000  ...    87.750000    90.000000
            50%     229.500000   189.000000  ...   191.000000   208.000000
            75%     420.500000   413.000000  ...   405.750000   414.000000
            max    5388.000000  5278.000000  ...  5335.000000  5367.000000

[8 rows x 5 columns]

# Pandas Operations

In [0]:
df_one = pd.DataFrame({'k1': ['A','A','B','B','C','C'],
                       'col1': [100,200,300,300,400,500],
                       'col2': ['NY', 'CA', 'WA', 'WA', 'AK',' NV']})

In [0]:
df_one['col2'].unique() #Returns any unique value

array(['NY', 'CA', 'WA', 'AK', ' NV'], dtype=object)

In [0]:
df_one['col2'].nunique() #Rutnrs the n unique values

5

In [0]:
df_one['col2'].value_counts()

WA     2
NY     1
AK     1
CA     1
 NV    1
Name: col2, dtype: int64

In [0]:
df_one['NEW'] = df_one['col1'] * 10
df_one

  k1  col1 col2   NEW
0  A   100   NY  1000
1  A   200   CA  2000
2  B   300   WA  3000
3  B   300   WA  3000
4  C   400   AK  4000
5  C   500   NV  5000

In [0]:
def grab_first_letter(state):
  return state[0]

In [0]:
grab_first_letter('NY')

'N'

In [0]:
df_one['first_letter'] = df_one['col2'].apply(grab_first_letter)

df_one

  k1  col1 col2   NEW first_letter
0  A   100   NY  1000            N
1  A   200   CA  2000            C
2  B   300   WA  3000            W
3  B   300   WA  3000            W
4  C   400   AK  4000            A
5  C   500   NV  5000

In [0]:
def complex_letter(state):

  if state[0] == 'W':
    return 'Washington'
  else: 
    return 'Error'

In [0]:
df_one['col2'].apply(complex_letter)

0         Error
1         Error
2    Washington
3    Washington
4         Error
5         Error
Name: col2, dtype: object

In [0]:
df_one['k1']

0    A
1    A
2    B
3    B
4    C
5    C
Name: k1, dtype: object

In [0]:
my_map = {'A': 1, 'B':2 , 'C':3}

In [0]:
df_one['num'] = df_one['k1'].map(my_map)

In [0]:
df_one

  k1  col1 col2   NEW first_letter  num
0  A   100   NY  1000            N    1
1  A   200   CA  2000            C    1
2  B   300   WA  3000            W    2
3  B   300   WA  3000            W    2
4  C   400   AK  4000            A    3
5  C   500   NV  5000                 3

In [0]:
df_one['col1'].idxmax()

5

In [0]:
features = pd.DataFrame({'A': [100, 200, 300, 300, 400, 500],
                          'B': [12,13,14,15,16,16]})

predictions = pd.DataFrame({'pred': [0,1,1,0,1]})

In [0]:
features

     A   B
0  100  12
1  200  13
2  300  14
3  300  15
4  400  16
5  500  16

In [0]:
predictions

   pred
0     0
1     1
2     1
3     0
4     1

In [0]:
pd.concat([features, predictions ], axis = 1)

     A   B  pred
0  100  12   0.0
1  200  13   1.0
2  300  14   1.0
3  300  15   0.0
4  400  16   1.0
5  500  16   NaN

In [0]:
pd.get_dummies(df_one['col2'])

    NV  AK  CA  NY  WA
0    0   0   0   1   0
1    0   0   1   0   0
2    0   0   0   0   1
3    0   0   0   0   1
4    0   1   0   0   0
5    1   0   0   0   0

# Data Input and Output
Pandas as fortunately has a robust IO tools we can use.

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.read_csv('sample_data/example.csv')
df.head()

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [0]:
df.to_csv('output.csv', index = True)

# Pandas Exercices!!

In [0]:
import pandas as pd
import numpy as np

In [0]:
africa = pd.read_csv('african_econ_crises.csv')
africa.head()

   case  cc3  country  ...  currency_crises  inflation_crises  banking_crisis
0     1  DZA  Algeria  ...                0                 0          crisis
1     1  DZA  Algeria  ...                0                 0       no_crisis
2     1  DZA  Algeria  ...                0                 0       no_crisis
3     1  DZA  Algeria  ...                0                 0       no_crisis
4     1  DZA  Algeria  ...                0                 0       no_crisis

[5 rows x 14 columns]

How many countries are represented in this data set?

In [0]:
africa['country'].value_counts()

Egypt                       155
South Africa                114
Zimbabwe                     90
Algeria                      85
Angola                       77
Tunisia                      75
Morocco                      75
Zambia                       72
Mauritius                    68
Kenya                        67
Ivory Coast                  63
Nigeria                      60
Central African Republic     58
Name: country, dtype: int64

How many countries are represented in this data set?

In [0]:
africa['country'].unique()

array(['Algeria', 'Angola', 'Central African Republic', 'Ivory Coast',
       'Egypt', 'Kenya', 'Mauritius', 'Morocco', 'Nigeria',
       'South Africa', 'Tunisia', 'Zambia', 'Zimbabwe'], dtype=object)

What country had this highest annual CPI Inflation rate? What was the inflation rate?

In [0]:
africa.sort_values('inflation_annual_cpi', ascending = False).head(1)

      case  cc3   country  ...  currency_crises  inflation_crises  banking_crisis
1053    70  ZWE  Zimbabwe  ...                1                 1          crisis

[1 rows x 14 columns]

What year did Kenya have it first System Crisis?

In [0]:
africa[(africa['country'] == 'Kenya') & (africa['systemic_crisis'] == 1)].sort_values('year')

     case  cc3 country  ...  currency_crises  inflation_crises  banking_crisis
475    35  KEN   Kenya  ...                0                 0          crisis
476    35  KEN   Kenya  ...                0                 0          crisis
477    35  KEN   Kenya  ...                0                 0          crisis
478    35  KEN   Kenya  ...                0                 0          crisis
479    35  KEN   Kenya  ...                1                 0       no_crisis
482    35  KEN   Kenya  ...                1                 1          crisis
483    35  KEN   Kenya  ...                1                 1          crisis
484    35  KEN   Kenya  ...                0                 1          crisis
485    35  KEN   Kenya  ...                0                 0          crisis
486    35  KEN   Kenya  ...                0                 0       no_crisis
487    35  KEN   Kenya  ...                0                 0       no_crisis
488    35  KEN   Kenya  ...                0                 0       no_crisis
489    35  KEN   Kenya  ...                1                 0       no_crisis

[13 rows x 14 columns]

How many yearly systemic crisises have occurred per country?

In [0]:
crisis = africa[africa['systemic_crisis'] == 1]

crisis.groupby('country').count()['systemic_crisis'].sort_values()

country
Morocco                      2
Algeria                      4
Ivory Coast                  4
Zambia                       4
Tunisia                      5
Egypt                        6
Nigeria                     10
Kenya                       13
Zimbabwe                    15
Central African Republic    19
Name: systemic_crisis, dtype: int64

How many years did Zimbabwe have a sovering external debt default occur?

In [0]:
len(africa[(africa['country'] == 'Zimbabwe') & (africa['sovereign_external_debt_default'] == 1)])

What year did Algeria have it highest exchange rate?

In [0]:
rate = africa[(africa['country'] == 'Algeria') & ()]

In [0]:
algeria = africa[africa['country'] == 'Algeria']
algeria.sort_values('exch_usd', ascending = False).head(1)

    case  cc3  country  ...  currency_crises  inflation_crises  banking_crisis
84     1  DZA  Algeria  ...                0                 0       no_crisis

[1 rows x 14 columns]